import React from "react";
import style from "../../styles/About.module.css";
import { motion } from "framer-motion";

import AboutCards from "../../Components/Main/About/AboutCards";
const About = () => {
  return (
    <motion.div
      initial={{ opacity: 0 }}
      animate={{ opacity: 1 }}
      transition={({ duration: 1.5 }, { delay: 0.2 })}
      exit={{ opacity: 0 }}
      className={style.container}
    >
      <div className={style.imgContainer}>
        <div className={style.ovarlay}></div>
        <img
          className={style.aboutHeadImg}
          src="/statics/About/AboutHeader.jpg"
          alt="موسسه خیریه مهتا"
        />
      </div>

      <div className={style.headerContainer}>
        <img className={style.headLogo} src="/statics/logo.svg" alt="Mahta" />
        <h1 className={style.mahta}>موسسه خیریه مهتا</h1>
        <p className={style.aboutMahta}>
          مهتا، موسسه اى خيريه و غيرانتفاعى است كه با كمك هاى افراد خير، سازمان
          ها و شركت هاى خصوصى و باتكيه بر منابع انسانى و متخصص علاقه مند داخلى و
          سرمايه علمی ايرانيان متخصص در خارج از كشور و ارتباط کارآمد و مستمر با
          انجمن هاى بين المللى مربوط به موضوع فعاليت موسسه، نظير فدراسيون جهانى
          هموفيلى و انجمن ب ينالمللى ترومبوز و هموستاز و … فعاليت می كند.
        </p>
        <p className={style.aboutMahta}>
          موسسه خیریه مهتا با ارائه خدمات مددكارى، تشخيصى، درمانى، دارویی،
          پيشگيرى و ارتقاء سطح آگاهى خانواده های بیماران و افراد جامعه، باهدف
          كاهش صدمات مادى و معنوى ناشى از اين بيماری ها، فعالیت خودرا از سال
          ۱۳۹۳ آغاز کرده است. جمعیت هدف این موسسه در سراسر کشور حدود ۱۲ هزار نفر
          بیمار ثبت شده با اختلالات انعقادی خونریزی دهنده و بیش از ۴۰ هزار نفر
          ناقلان این بیماری ها می باشند. با توجه به اینکه یک چهارم مرگ و میرها
          به دلیل ترومبوز است، میلیون ها نفر نیز گرفتار مشکلات ترومبوز و تبعات
          ناشی از آن هستند.
        </p>
        <p className={style.aboutMahta}>
          باتوجه به اهمیت پیشگیری از تولد بیماران صعب العلاج، درحال حاضر تیمی
          متشکل از مشاوران ژنتیک و هم چنین آزمایشگاه مجهز و پیشرفته ژنتیک، به
          بیماران و خانواده های آنها، خدمات تعیین موتاسیون ژنتیکی بیماری، تعیین
          ناقلان بیماری و پیشگیری از تولد فرزند مبتلا را ارایه می دهند. هم چنین
          بیماران سراسر کشور که به این موسسه مراجعه می کنند، از پزشکان حاذق این
          موسسه که به صورت داوطلب حضور دارند، خدمات تخصصی و فوق تخصصی در زمینه
          های خون، کبد و گوارش، زنان، ارتوپدی، روانپزشکی، روانشناسی و ……به صورت
          رایگان دریافت م یکنند
        </p>
        <p className={style.aboutMahta}>
          باتوجه به اینکه حوزه فعالیت مهتا، ملی است، با مساعدت این موسسه انجمن
          های مردم نهادی با اهداف و قابلیت هایی مشابه مهتا در مراکز استان ها در
          حال شکل گیری است، تا با ایجاد شبکه ای منسجم خدمات درمان جامع موثری
          برای این بیماران، در سراسر کشورمان ارائه شود.
        </p>
        <p className={style.aboutMahta}>
          از بذل توجه و حسن نیت شما به امور خیر کمال تشکر و قدردانی می شود.
        </p>
      </div>
      <AboutCards />
    </motion.div>
  );
};

export default About;
